In [154]:
!pip list

Package                   Version
------------------------- -----------
altgraph                  0.17.4
asttokens                 3.0.0
attrs                     25.3.0
beautifulsoup4            4.13.4
blinker                   1.9.0
certifi                   2025.4.26
cffi                      1.17.1
charset-normalizer        3.4.2
click                     8.2.1
colorama                  0.4.6
comm                      0.2.2
contourpy                 1.3.2
cycler                    0.12.1
debugpy                   1.8.14
decorator                 5.2.1
et_xmlfile                2.0.0
exceptiongroup            1.2.2
executing                 2.2.0
Flask                     3.1.1
flask-cors                6.0.1
fonttools                 4.59.0
greenlet                  3.2.4
h11                       0.16.0
idna                      3.10
ipykernel                 6.29.5
ipython                   8.36.0
itsdangerous              2.2.0
jedi                      0.19.2
Jinja2                    3.1.6
jupyter_client            8.6.3
jupyter_core              5.7.2
kiwisolver                1.4.8
lxml                      6.0.0
MarkupSafe                3.0.2
matplotlib                3.10.3
matplotlib-inline         0.1.7
mysql-connector-python    9.4.0
nest-asyncio              1.6.0
numpy                     2.2.5
openpyxl                  3.1.5
outcome                   1.3.0.post0
packaging                 25.0
pandas                    2.2.3
parso                     0.8.4
pefile                    2023.2.7
pillow                    11.3.0
pip                       21.2.3
platformdirs              4.3.8
prompt_toolkit            3.0.51
psutil                    7.0.0
pure_eval                 0.2.3
pycparser                 2.22
Pygments                  2.19.1
pyinstaller               6.14.1
pyinstaller-hooks-contrib 2025.5
PyMySQL                   1.1.2
pyparsing                 3.2.3
PySocks                   1.7.1
python-dateutil           2.9.0.post0
python-dotenv             1.1.0
pytz                      2025.2
pywin32                   310
pywin32-ctypes            0.2.3
pyzmq                     26.4.0
requests                  2.32.3
selenium                  4.33.0
setuptools                57.4.0
six                       1.17.0
sniffio                   1.3.1
sortedcontainers          2.4.0
soupsieve                 2.7
SQLAlchemy                2.0.43
stack-data                0.6.3
tornado                   6.4.2
traitlets                 5.14.3
trio                      0.30.0
trio-websocket            0.12.2
typing_extensions         4.13.2
tzdata                    2025.2
urllib3                   2.4.0
wcwidth                   0.2.13
webdriver-manager         4.0.2
websocket-client          1.8.0
Werkzeug                  3.1.3
wsproto                   1.2.0

WARNING: You are using pip version 21.2.3; however, version 25.2 is available.
You should consider upgrading via the 'C:\Temp\2025\venv310\Scripts\python.exe -m pip install --upgrade pip' command.

In [155]:
import pandas as pd

city = {
    '도시': ['서울', '부산', '울산'],
    '인구': [940, 330, 110]
}

df = pd.DataFrame(city, index = ['1등', '2등', '3등'])
df

    도시   인구
1등  서울  940
2등  부산  330
3등  울산  110

In [156]:
import pandas as pd
data = [['김민재', 27, 75, 5428000],
        ['이강인', 22, 57, 3428000],
        ['박찬호', 50, 91, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]

df = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
df

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000
5  손흥민  31   72  7028000
6  황희찬  28   69  2528000

In [157]:
import pandas as pd

data = {
    '이름' : ['김철수','이영희','박민수','정성훈'],
    '나이' : [25,30,28,35],
    '성적' : [85.5, 92.3, 78.8, 96.5],
    '합격여부' : [True, True, False, True]
}
df = pd.DataFrame(data)
df

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

### csv 파일로 저장

In [158]:
df.to_csv('학생데이터.csv', encoding = 'utf-8', index = False)

### csv 파일 데이터 가져오기1(로컬)

In [159]:
df_csv = pd.read_csv('학생데이터.csv', encoding = 'utf-8')
df_csv

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

### csv 파일 데이터 가져오기2(링크)

In [160]:
titanic_csv = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv', encoding = 'utf-8')
titanic_csv

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 엑셀파일로 저장

In [161]:
df.to_excel('학생데이터.xlsx', sheet_name = '학생정보', index = False)

### 엑셀 파일 불러오기

In [162]:
df_excel = pd.read_excel('학생데이터.xlsx', sheet_name = '학생정보')
df_excel

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

In [163]:
html_doc = df.to_html(index = False)
print(html_doc,type(html_doc))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>이름</th>
      <th>나이</th>
      <th>성적</th>
      <th>합격여부</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>김철수</td>
      <td>25</td>
      <td>85.5</td>
      <td>True</td>
    </tr>
    <tr>
      <td>이영희</td>
      <td>30</td>
      <td>92.3</td>
      <td>True</td>
    </tr>
    <tr>
      <td>박민수</td>
      <td>28</td>
      <td>78.8</td>
      <td>False</td>
    </tr>
    <tr>
      <td>정성훈</td>
      <td>35</td>
      <td>96.5</td>
      <td>True</td>
    </tr>
  </tbody>
</table> <class 'str'>

In [164]:
with open('학생데이터.html', 'w', encoding='utf-8') as f:
    # f.write(df.to_html(index = False)) <- 권장되지 않는 방식
    df.to_html(f, index = False)

In [ ]:
df_html_list = pd.read_html('학생데이터.html', encoding='utf-8')
len(df_html_list)
df_html = df_html_list[0]

# df_html = pd.read_html('학생데이터.html', encoding='utf-8')[0]

df_html

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

### html로 저장

In [166]:
html_content = '''
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
</head>
<body>
    <h2>1학기 성적</h2>
    <table>
        <tr><th>이름</th><th>점수</th></tr>
        <tr><td>김철수</td><td>85</td></tr>
        <tr><td>이영희</td><td>92</td></tr>
    </table>

    <h2>2학기 성적</h2>
    <table>
        <tr><th>이름</th><th>점수</th></tr>
        <tr><td>김철수</td><td>88</td></tr>
        <tr><td>이영희</td><td>95</td></tr>
    </table>
</body>
</html>
'''
with open('성적데이터.html', 'w', encoding='utf-8') as f:
    f.write(html_content)

### html 파일 데이터 가져오기

In [167]:
tables = pd.read_html('성적데이터.html', encoding='utf-8')
print(type(tables))
print(type(tables[0]))

<class 'list'>
<class 'pandas.core.frame.DataFrame'>

In [168]:
print("발견된 테이블 수:", len(tables))
print("\n첫 번째 테이블 (tables[0]):")
print(tables[0])
print("\n두 번째 테이블 (tables[1]):")
print(tables[1])

발견된 테이블 수: 2

첫 번째 테이블 (tables[0]):
    이름  점수
0  김철수  85
1  이영희  92

두 번째 테이블 (tables[1]):
    이름  점수
0  김철수  88
1  이영희  95

### 본인 User-Agent 알려주는 사이트
"https://www.whatismybrowser.com/detect/what-is-my-user-agent/"

### 금융 데이터 실습

In [169]:
import pandas as pd
import requests
from io import StringIO

url = "https://finance.naver.com/sise/sise_market_sum.naver"

headers = {
    'User-Agent' : 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36'
}
response = requests.get(url, headers = headers)
response.encoding = 'euc-kr'
html_io = StringIO(response.text)

tables = pd.read_html(html_io, encoding = 'euc-kr')
df = tables[1]
# df.dropna = 결측치 제거 함수
# 기본 축: axis=0이 기본 → “행”을 검사해 제거
# 기준: how='all' → 전부 결측치일 때만 제거
# 대조: how='any'는 하나라도 결측치가 있으면 제거
# 부분열만 검사: subset=['열A','열B']로 검사 대상 열 한정 가능
# 열 제거: axis=1을 주면 “열” 기준으로 동작
# thresh와 동시 사용 금지: how와 thresh는 함께 쓸 수 없습니다(둘 다 주면 에러)
df = df.dropna(how = 'all')             # 모든 행이 NaN일 때
df = df.dropna(how = 'all', axis = 1)   # 모든 열이 NaN일 때
df.head(10)

,N,종목명,현재가,전일비,등락률,액면가,시가총액,상장주식수,외국인비율,거래량,PER,ROE
1,1.0,삼성전자,69300.0,"상승 1,700",+2.51%,100.0,4102309.0,5919638.0,50.32,7604214.0,15.48,9.03
2,2.0,SK하이닉스,260750.0,"상승 4,750",+1.86%,5000.0,1898266.0,728002.0,55.06,1101034.0,6.58,31.06
3,3.0,LG에너지솔루션,349000.0,보합0,0.00%,500.0,816660.0,234000.0,4.24,103109.0,-82.53,-4.93
4,4.0,삼성바이오로직스,1000000.0,"상승 4,000",+0.40%,2500.0,711740.0,71174.0,12.81,35490.0,55.35,10.45
5,5.0,한화에어로스페이스,935000.0,"상승 19,000",+2.07%,5000.0,482118.0,51563.0,43.93,98637.0,18.13,53.94
9,6.0,삼성전자우,56300.0,상승 900,+1.62%,100.0,459394.0,815975.0,74.20,731558.0,12.58,NaN
10,7.0,HD현대중공업,510000.0,보합0,0.00%,5000.0,452743.0,88773.0,10.91,122994.0,48.48,11.39
11,8.0,현대차,219500.0,"하락 1,000",-0.45%,5000.0,449443.0,204758.0,36.40,279200.0,5.17,12.43
12,9.0,기아,106800.0,상승 300,+0.28%,5000.0,420567.0,393789.0,40.30,285298.0,4.91,19.09
13,10.0,KB금융,108650.0,"상승 1,550",+1.45%,5000.0,414459.0,381462.0,77.52,280001.0,7.54,8.86

### 특정 컬럼 정보를 상위 5개만

In [170]:
result = df[['종목명','현재가']].head(5)
result

         종목명        현재가
1       삼성전자    69300.0
2     SK하이닉스   260750.0
3   LG에너지솔루션   349000.0
4   삼성바이오로직스  1000000.0
5  한화에어로스페이스   935000.0

### 특정범위 컬럼 정보를 상위 5개만(loc와 슬라이싱)

In [171]:
result2 = df.loc[:5, '종목명':'등락률']
result2

         종목명        현재가         전일비     등락률
1       삼성전자    69300.0   상승  1,700  +2.51%
2     SK하이닉스   260750.0   상승  4,750  +1.86%
3   LG에너지솔루션   349000.0         보합0   0.00%
4   삼성바이오로직스  1000000.0   상승  4,000  +0.40%
5  한화에어로스페이스   935000.0  상승  19,000  +2.07%

### 특정범위 컬럼 정보를 특정 행만(loc와 슬라이싱)

In [172]:
valid_rows = df.index.intersection([1,3,5,7,9])  # 실제로 존재하는 숫자(인덱스)만 추림
result2 = df.loc[valid_rows, '종목명':'등락률']   # 즉 실제 존재하는 행만 가져옴
result2

         종목명       현재가         전일비     등락률
1       삼성전자   69300.0   상승  1,700  +2.51%
3   LG에너지솔루션  349000.0         보합0   0.00%
5  한화에어로스페이스  935000.0  상승  19,000  +2.07%
9      삼성전자우   56300.0     상승  900  +1.62%

### 특정범위 컬럼 정보를 상위 5개만(iloc와 슬라이싱)

In [173]:
df2 = df.iloc[:5, 1:]
df2

,종목명,현재가,전일비,등락률,액면가,시가총액,상장주식수,외국인비율,거래량,PER,ROE
1,삼성전자,69300.0,"상승 1,700",+2.51%,100.0,4102309.0,5919638.0,50.32,7604214.0,15.48,9.03
2,SK하이닉스,260750.0,"상승 4,750",+1.86%,5000.0,1898266.0,728002.0,55.06,1101034.0,6.58,31.06
3,LG에너지솔루션,349000.0,보합0,0.00%,500.0,816660.0,234000.0,4.24,103109.0,-82.53,-4.93
4,삼성바이오로직스,1000000.0,"상승 4,000",+0.40%,2500.0,711740.0,71174.0,12.81,35490.0,55.35,10.45
5,한화에어로스페이스,935000.0,"상승 19,000",+2.07%,5000.0,482118.0,51563.0,43.93,98637.0,18.13,53.94

In [174]:
import pandas as pd
import requests
from io import StringIO

url_sports = "https://www.koreabaseball.com/record/teamrank/teamrank.aspx"

headers = {
    'User-Agent' : 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36'
}
response = requests.get(url_sports, headers = headers)
response.encoding = 'utf-8'
html_io = StringIO(response.text)

tables = pd.read_html(html_io, encoding = 'utf-8')
df_sports = tables[0]
df_sports = df_sports.dropna(how = 'all')             # 모든 행이 NaN일 때
df_sports = df_sports.dropna(how = 'all', axis = 1)   # 모든 열이 NaN일 때
# df.head(10)
df_sports

   순위   팀명   경기   승   패  무     승률   게임차  최근10경기  연속        홈       방문
0   1   LG  125  76  46  3  0.623   0.0  6승1무3패  1패  39-1-23  37-2-23
1   2   한화  124  70  51  3  0.579   5.5  5승0무5패  3패  37-2-25  33-1-26
2   3  SSG  123  61  58  4  0.513  13.5  5승0무5패  1승  30-4-29  31-0-29
3   4   롯데  127  62  59  6  0.512  13.5  4승2무4패  1승  33-4-29  29-2-30
4   5   삼성  125  63  60  2  0.512  13.5  8승0무2패  3승  33-0-26  30-2-34
5   6   KT  126  62  60  4  0.508  14.0  6승0무4패  2승  31-1-30  31-3-30
6   7   NC  120  56  58  6  0.491  16.0  5승0무5패  1패  28-1-28  28-5-30
7   8  KIA  122  57  61  4  0.483  17.0  3승0무7패  2패  30-2-25  27-2-36
8   9   두산  125  54  65  6  0.454  20.5  3승1무6패  1패  26-4-35  28-2-30
9  10   키움  127  40  83  4  0.325  36.5  3승0무7패  1승  21-2-43  19-2-40

### '최근10경기'를 기준으로 정렬, ascending = True : 오름차순, False : 내림차순

In [175]:
sorted_df = df_sports.sort_values(by='최근10경기', ascending=False)
sorted_df

   순위   팀명   경기   승   패  무     승률   게임차  최근10경기  연속        홈       방문
4   5   삼성  125  63  60  2  0.512  13.5  8승0무2패  3승  33-0-26  30-2-34
0   1   LG  125  76  46  3  0.623   0.0  6승1무3패  1패  39-1-23  37-2-23
5   6   KT  126  62  60  4  0.508  14.0  6승0무4패  2승  31-1-30  31-3-30
1   2   한화  124  70  51  3  0.579   5.5  5승0무5패  3패  37-2-25  33-1-26
2   3  SSG  123  61  58  4  0.513  13.5  5승0무5패  1승  30-4-29  31-0-29
6   7   NC  120  56  58  6  0.491  16.0  5승0무5패  1패  28-1-28  28-5-30
3   4   롯데  127  62  59  6  0.512  13.5  4승2무4패  1승  33-4-29  29-2-30
8   9   두산  125  54  65  6  0.454  20.5  3승1무6패  1패  26-4-35  28-2-30
7   8  KIA  122  57  61  4  0.483  17.0  3승0무7패  2패  30-2-25  27-2-36
9  10   키움  127  40  83  4  0.325  36.5  3승0무7패  1승  21-2-43  19-2-40

In [176]:
import pandas as pd

data = {
    '이름': ['김철수', '이영희', '박민수', '정성훈'],
    '나이': [25, 30, 28, 35],
    '성적': [85.5, 92.3, 78.8, 96.5],
    '합격여부': [True, True, False, True]
}
df = pd.DataFrame(data)
df

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

### 판다스(DataFrame) 객체 -> JSON 문자열로 변환
- 'recoreds'로 설정하면, 각 행이 하나의 JSON 객체로 변환되어 리스트 형태로 반환

In [177]:
json_str = df.to_json(orient = 'records', force_ascii = False)
json_str

'[{"이름":"김철수","나이":25,"성적":85.5,"합격여부":true},{"이름":"이영희","나이":30,"성적":92.3,"합격여부":true},{"이름":"박민수","나이":28,"성적":78.8,"합격여부":false},{"이름":"정성훈","나이":35,"성적":96.5,"합격여부":true}]'

In [178]:
type(json_str)

str

### JSON 문자열 -> 파이썬 객체(JSON형식)로 변환

In [179]:
import json
json_str = df.to_json(orient = 'records', force_ascii = False)
json_data = json.loads(json_str)
json_data

[{'이름': '김철수', '나이': 25, '성적': 85.5, '합격여부': True},
 {'이름': '이영희', '나이': 30, '성적': 92.3, '합격여부': True},
 {'이름': '박민수', '나이': 28, '성적': 78.8, '합격여부': False},
 {'이름': '정성훈', '나이': 35, '성적': 96.5, '합격여부': True}]

In [180]:
print(json_data[0]['이름'])

김철수

### 판다스 객체를 JSON파일로 저장

In [181]:
df.to_json('학생데이터.json', orient = 'records', force_ascii = False)

### JSON파일을 판다스로 가져오기

In [182]:
df_json = pd.read_json('학생데이터.json')
df_json

    이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  28  78.8  False
3  정성훈  35  96.5   True

#### 이름과 성적만 보기

In [183]:
df_json[['이름','성적']]

    이름    성적
0  김철수  85.5
1  이영희  92.3
2  박민수  78.8
3  정성훈  96.5

In [184]:
df_json.loc[[0,2],['이름','성적']]

    이름    성적
0  김철수  85.5
2  박민수  78.8

In [185]:
df_json.loc[df_json['합격여부'] == True,['이름','성적','합격여부']]

    이름    성적  합격여부
0  김철수  85.5  True
1  이영희  92.3  True
3  정성훈  96.5  True

In [6]:
import pandas as pd
from sqlalchemy import create_engine

data = {
    '이름' : ['김철수','이영희','박민수','정성훈'],
    '나이' : [25,30,28,35],
    '성적' : [85.5, 92.3, 78.8, 96.5],
    '합격여부' : [True, True, False, True]
}

df = pd.DataFrame(data)
engine = create_engine('sqlite:///학생데이터.db')
df.to_sql('학생테이블', engine, if_exists='replace', index = False)

4

#### 원하는 조건의 데이터 가져오기

In [10]:
df_sql = pd.read_sql('select * from 학생테이블 where 합격여부 = 1', engine)
df_sql

    이름  나이    성적  합격여부
0  김철수  25  85.5     1
1  이영희  30  92.3     1
2  정성훈  35  96.5     1

In [11]:
df_sql = pd.read_sql('select * from 학생테이블', engine)
df_sql[df_sql['성적']>=90]

    이름  나이    성적  합격여부
1  이영희  30  92.3     1
3  정성훈  35  96.5     1

In [33]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:1234@192.168.0.170:3306/employee_db')
sql = '''
    SELECT department, salary, AVG(salary) as avg_salary
    FROM employees
    GROUP BY department, salary WITH ROLLUP
    '''
df = pd.read_sql(sql, engine)
df

   department      salary  avg_salary
0          IT  50000000.0  50000000.0
1          IT         NaN  50000000.0
2         개발팀        45.0        45.0
3         개발팀  48000000.0  48000000.0
4         개발팀  51000000.0  51000000.0
5         개발팀         NaN  33000015.0
6        마케팅팀  41000000.0  41000000.0
7        마케팅팀  42000000.0  42000000.0
8        마케팅팀         NaN  41500000.0
9         영업팀  39000000.0  39000000.0
10        영업팀  43000000.0  43000000.0
11        영업팀         NaN  41000000.0
12        인사팀  36000000.0  36000000.0
13        인사팀  38000000.0  38000000.0
14        인사팀         NaN  37000000.0
15       None         NaN  38800004.5

In [ ]:
import pandas as pd
data = [['김민재', 31, 75, 5428000],
        ['이강인', 22, 57, None],
        ['박찬호', 50, None, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]
df = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
df.to_csv('pandas.csv', encoding='CP949', index=False) # 윈도우용 파일로 저장

In [37]:
df

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [ ]:
import pandas as pd
df = pd.read_csv('pandas.csv', encoding='CP949')
df

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [41]:
df.columns

Index(['성명', '나이', '몸무게', '급여'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [53]:
df.shape
df.dtypes
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성명      7 non-null      object
 1   나이      7 non-null      int64
 2   몸무게     6 non-null      float64
 3   급여      6 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

              나이         몸무게            급여
count   7.000000    6.000000  6.000000e+00
mean   39.285714   75.500000  5.394667e+06
std    16.509737   14.265343  2.086784e+06
min    22.000000   57.000000  2.528000e+06
25%    29.500000   69.750000  4.453000e+06
50%    31.000000   73.500000  4.978000e+06
75%    46.500000   78.750000  6.628000e+06
max    70.000000  100.000000  8.428000e+06

#### 상위 5개

In [46]:
df.head()

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0

#### 하위 5개

In [55]:
df.tail()

    성명  나이    몸무게         급여
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [61]:
# .isin() 메서드 : 특정 값과 일치하는지 여부(True, False)
df2 = df[df['성명'].isin(['박찬호', '추신수'])]
df2

    성명  나이    몸무게         급여
2  박찬호  50    NaN  8428000.0
4  추신수  43  100.0  4528000.0

In [71]:
df2.loc[df2['성명'] == '박찬호', '나이'] = 45
df2

    성명  나이    몸무게         급여
2  박찬호  45    NaN  8428000.0
4  추신수  43  100.0  4528000.0

In [72]:
import pandas as pd
data = {
    '성명': ['박찬호', '이승엽', '김태균'],
    '나이': [45, 40, 35]
}
df3 = pd.DataFrame(data)

df3.loc[df3['성명'] == '이승엽', '나이'] = 41
df3

    성명  나이
0  박찬호  45
1  이승엽  41
2  김태균  35

In [83]:
import pandas as pd
data = [['김민재', 31, 75, 5428000],
        ['이강인', 22, 57, None],
        ['박찬호', 50, None, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]
df4 = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
# df4['성명'] # 시리즈
# df4[['성명']] # 데이터프레임
df4[['성명','급여']]

    성명         급여
0  김민재  5428000.0
1  이강인        NaN
2  박찬호  8428000.0
3  차범근  4428000.0
4  추신수  4528000.0
5  손흥민  7028000.0
6  황희찬  2528000.0

In [84]:
df.filter(['성명','급여']) # 유연한 선택지원

    성명         급여
0  김민재  5428000.0
1  이강인        NaN
2  박찬호  8428000.0
3  차범근  4428000.0
4  추신수  4528000.0
5  손흥민  7028000.0
6  황희찬  2528000.0

In [86]:
df.filter(like = '급') # 컬럼 기준으로 특정 문자열 포함되어 있는지

          급여
0  5428000.0
1        NaN
2  8428000.0
3  4428000.0
4  4528000.0
5  7028000.0
6  2528000.0

In [87]:
# regex(정규표현식)
df.filter(regex = '^[가-힣]') # 한글로 시작하는 컬럼

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [88]:
df.filter([1,2], axis = 0) # 행 기준(기본값 : 열(axis = 1))

    성명  나이   몸무게         급여
1  이강인  22  57.0        NaN
2  박찬호  50   NaN  8428000.0

In [96]:
df.loc[[1,2]]
df.loc[1:2]

    성명  나이   몸무게         급여
1  이강인  22  57.0        NaN
2  박찬호  50   NaN  8428000.0

In [98]:
df.loc[0:3,['성명','급여']]

    성명         급여
0  김민재  5428000.0
1  이강인        NaN
2  박찬호  8428000.0
3  차범근  4428000.0

In [100]:
df['급여'] > 5000000

0     True
1    False
2     True
3    False
4    False
5     True
6    False
Name: 급여, dtype: bool

In [107]:
df.loc[df['급여'] > 5000000, ['성명','나이','급여']]

    성명  나이         급여
0  김민재  31  5428000.0
2  박찬호  50  8428000.0
5  손흥민  31  7028000.0

In [109]:
df[(df['성명'] == '손흥민') | (df['성명'] == '이강인')]

    성명  나이   몸무게         급여
1  이강인  22  57.0        NaN
5  손흥민  31  72.0  7028000.0

In [118]:
football = df[df['성명'].isin(['김민재','손흥민'])]
football

    성명  나이   몸무게         급여
0  김민재  31  75.0  5428000.0
5  손흥민  31  72.0  7028000.0

In [120]:
고액연봉자 = df[df['급여'] > 5000000]
고액연봉자

    성명  나이   몸무게         급여
0  김민재  31  75.0  5428000.0
2  박찬호  50   NaN  8428000.0
5  손흥민  31  72.0  7028000.0

In [123]:
고액연봉자[고액연봉자['급여'] > 7000000]

    성명  나이   몸무게         급여
2  박찬호  50   NaN  8428000.0
5  손흥민  31  72.0  7028000.0

#### sample

In [249]:
# 랜덤으로 n개의 행을 추출
df.sample(3)

    성명  나이    몸무게         급여
4  추신수  43  100.0  4528000.0
2  박찬호  50    NaN  8428000.0
0  김민재  31   75.0  5428000.0

In [267]:
# frac
train = df.sample(frac = 0.7) # 랜덤 (백분율, 0.7 = 70%)
train

    성명  나이    몸무게         급여
5  손흥민  31   72.0  7028000.0
4  추신수  43  100.0  4528000.0
1  이강인  22   57.0        NaN
3  차범근  70   80.0  4428000.0
2  박찬호  50    NaN  8428000.0

In [269]:
train.index

Index([5, 4, 1, 3, 2], dtype='int64')

In [272]:
test = df.drop(train.index) # 70%를 제거하고 나머지 30%를 test에 저장
test

    성명  나이   몸무게         급여
0  김민재  31  75.0  5428000.0
6  황희찬  28  69.0  2528000.0

In [274]:
df5 = pd.concat(
    [
        df[df['나이'] > 40].sample(2),
        df[df['나이'] <= 40].sample(2)
    ]
)
df5

    성명  나이   몸무게         급여
2  박찬호  50   NaN  8428000.0
3  차범근  70  80.0  4428000.0
0  김민재  31  75.0  5428000.0
5  손흥민  31  72.0  7028000.0

### sort_values
- 정렬 (by='컬럼' : 특정 컬럼 기준)
- ascending=True: 오름차순 (기본값)
- ascending=False: 내림차순

In [277]:
df.sort_values('나이')

    성명  나이    몸무게         급여
1  이강인  22   57.0        NaN
6  황희찬  28   69.0  2528000.0
5  손흥민  31   72.0  7028000.0
0  김민재  31   75.0  5428000.0
4  추신수  43  100.0  4528000.0
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0

In [276]:
df.sort_values('나이', ascending = False)

    성명  나이    몸무게         급여
3  차범근  70   80.0  4428000.0
2  박찬호  50    NaN  8428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
0  김민재  31   75.0  5428000.0
6  황희찬  28   69.0  2528000.0
1  이강인  22   57.0        NaN

In [280]:
df.sort_values(['나이','몸무게'], ascending = [False,True])

    성명  나이    몸무게         급여
3  차범근  70   80.0  4428000.0
2  박찬호  50    NaN  8428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
0  김민재  31   75.0  5428000.0
6  황희찬  28   69.0  2528000.0
1  이강인  22   57.0        NaN

#### 판다스
지원 파일 형식 : csv,excel, html, json, sql

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

data = {
    '이름' : ['김철수', '이영희', '박민수', '정성훈'],
    '나이' : [25, 30, 20, 35],
    '성적' : [85.5, 92.3, 78.8, 96.5],
    '합격여부' : [True, True, False, True]
}
# df 만들기
df = pd.DataFrame(data)

# 특정 형식으로 저장하기
# to csv
df.to_csv('df_to_csv.csv', encoding='utf-8', index = False)
# to excel
df.to_excel('df_to_excel.xlsx', sheet_name='ex', index=False)
# to html
with open('df_to_html.html','w', encoding='utf-8') as f:
    df.to_html(f, index = False)
# to json
df.to_json('df_to_json.json', orient = 'records', force_ascii = False)
# to db(sqlite)
engine = create_engine('sqlite:///df_to_sql.db')
df.to_sql('dftable', engine, if_exists='replace', index = False)

# 저장된 데이터 파일 불러오기
# load csv
df_csv = pd.read_csv('df_to_csv.csv')
print('[csv]\n',df_csv)
# load excel
df_excel = pd.read_excel('df_to_excel.xlsx')
print('\n[excel]\n',df_excel)
# load html
df_html = pd.read_html('df_to_html.html', encoding='utf-8')[0]
print('\n[html]\n',df_html)
# load json
df_json = pd.read_json('df_to_json.json')
print('\n[json]\n',df_json)
# load sql
sql = '''
    select * from dftable
'''
df_db = pd.read_sql(sql, engine)
print('\n[sql]\n',df_db)

[csv]
     이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  20  78.8  False
3  정성훈  35  96.5   True

[excel]
     이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  20  78.8  False
3  정성훈  35  96.5   True

[html]
     이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  20  78.8  False
3  정성훈  35  96.5   True

[json]
     이름  나이    성적   합격여부
0  김철수  25  85.5   True
1  이영희  30  92.3   True
2  박민수  20  78.8  False
3  정성훈  35  96.5   True

[sql]
     이름  나이    성적  합격여부
0  김철수  25  85.5     1
1  이영희  30  92.3     1
2  박민수  20  78.8     0
3  정성훈  35  96.5     1

In [ ]:
import pandas as pd
df = pd.read_csv('pandas.csv', encoding='CP949')
# columns
print(df.columns)
# index
print(df.index)
# shape
print(df.shape)
# dtypes
print(df.dtypes)
# info()
print(df.info())
# describe()
print(df.describe())
# head()
print(df.head())
# tail()
print(df.tail())
# loc로 검색
print(df.loc[[1,2]])
print(df.loc[1:2])
print(df.loc[0:3,['성명','급여']])
# 조건(.isin)
print(df[df['성명'].isin(['박찬호', '추신수'])])
# 조건(loc)
print(df.loc[df['급여'] > 5000000, ['성명','나이','급여']])
# df 데이터 수정
df.loc[df['성명'] == '박찬호', '나이'] = 45
print(df.loc[df['성명'] == '박찬호'])
# 속성으로 검색
print(df[['성명','급여']])
# filter
print(df.filter(['성명','급여']))
print(df.filter(like = '급'))
print(df.filter(regex = '^[가-힣]'))
print(df.filter([1,2], axis = 0))
# sample
print(df.sample(3))
train = df.sample(frac = 0.7)
test = df.drop(train.index)
print(train)
print(test)
df2 = pd.concat(
    [
        df[df['나이'] > 40].sample(2),
        df[df['나이'] <= 40].sample(2)
    ]
)
print(df2)
# sort
print(df.sort_values('나이'))
print(df.sort_values(['나이','몸무게'], ascending = [False,True]))

Index(['성명', '나이', '몸무게', '급여'], dtype='object')
RangeIndex(start=0, stop=7, step=1)
(7, 4)
성명      object
나이       int64
몸무게    float64
급여     float64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성명      7 non-null      object
 1   나이      7 non-null      int64
 2   몸무게     6 non-null      float64
 3   급여      6 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes
None
              나이         몸무게            급여
count   7.000000    6.000000  6.000000e+00
mean   39.285714   75.500000  5.394667e+06
std    16.509737   14.265343  2.086784e+06
min    22.000000   57.000000  2.528000e+06
25%    29.500000   69.750000  4.453000e+06
50%    31.000000   73.500000  4.978000e+06
75%    46.500000   78.750000  6.628000e+06
max    70.000000  100.000000  8.428000e+06
    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
    성명  나이    몸무게         급여
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0
    성명  나이    몸무게         급여
2  박찬호  50    NaN  8428000.0
4  추신수  43  100.0  4528000.0
    성명  나이  몸무게         급여
2  박찬호  45  NaN  8428000.0